<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"2d360ae3ae1b08b744180454e9ecaec4231a7d13f6d55ce326ef30084ac4886e","plan_job_ref":"Job .github/workflows/_test-tf.yaml #194 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361138676","plan_out_hash":"d1bcda19dff3fde6c9db45afac5dbd321b18b093371ea3df831cd9a391706914","plan_hash":"98a5d6ccbeece2dba8248da05a2cc3a5177ee6c45e2c431c965ae377d0a9edb9","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #194](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361138676)